// Со помош на знаците ‘@’,'%', и ‘.‘ се формира квадратна слика со „должина“ m (m>2) 
// која претставува квадрат од знаците '.', впишан во квадрат од знаците @ и %(види примери). 
// За внесено m да се испечати на екран соодветната слика. 
// Внимавајте – не печатете нити еден дополнителен знак, како празно место, непотребен знак за нов ред... 
// Сликата завршува со знак за нов ред. 
// Забелешка: Бидејќи е дадено ограничување за m, во точно решение на задачата не треба да се користи низа/матрица.

// For example:
// Input	Result
// 11       %@@@@@@@@@%
//          %.........%
//          %.........%
//          %.........%
//          %.........%
//          %.........%
//          %.........%
//          %.........%
//          %.........%
//          %.........%
//          %@@@@@@@@@%

#include <stdio.h>
#include <math.h>

void pecatiRamka(int size) {
    printf("%%");
    for (int i = 1; i < size - 1; i++)
        printf("@");
    printf("%%\n");
}

int main()
{
    int size;
    scanf("%d", &size);
    
    // Gorna ramka
    pecatiRamka(size);
    
    for (int i = 1; i < size - 1; i++) {
        printf("%%");
        for (int j = 1; j < size - 1; j++)
            printf(".");
        printf("%%\n");
    }
    
    // Dolna ramka
    pecatiRamka(size);
    return 0;
}
